In [1]:
import pandas as pd

In [2]:
!cat lec25.csv

q,r,s,t,apple
2,3,4,5,pear
a,s,d,f,rabbit
5,2,5,7,dog

In [3]:
dframe = pd.read_csv("lec25.csv")

In [4]:
dframe

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [5]:
dframe = pd.read_csv("lec25.csv", header=None)

In [6]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [8]:
dframe = pd.read_table("lec25.csv", sep=",", header=None)

In [9]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [11]:
pd.read_csv("lec25.csv", header=None, nrows=2)

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [12]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [13]:
dframe.to_csv("mytextdata_out.csv")

In [14]:
!cat mytextdata_out.csv

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [15]:
import sys

In [16]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [24]:
dframe.to_csv(sys.stdout, sep="_")

_0_1_2_3_4
0_q_r_s_t_apple
1_2_3_4_5_pear
2_a_s_d_f_rabbit
3_5_2_5_7_dog

In [28]:
dframe.to_csv(sys.stdout, sep="\t")

	0	1	2	3	4
0	q	r	s	t	apple
1	2	3	4	5	pear
2	a	s	d	f	rabbit
3	5	2	5	7	dog

In [29]:
dframe.to_csv(sys.stdout, columns=[0,1,2])

,0,1,2
0,q,r,s
1,2,3,4
2,a,s,d
3,5,2,5

In [30]:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [31]:
import json

In [32]:
data = json.loads(json_obj)

In [33]:
data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [34]:
type(data)

dict

In [36]:
data["diet"]

[{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]

In [37]:
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [38]:
json.dump(data, open("data.json", "w"))

In [39]:
!cat data.json

{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}

In [40]:
json.load(open("data.json"))

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [41]:
 url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

In [42]:
dframe_list = pd.io.html.read_html(url)

In [44]:
dframe = dframe_list[0]

In [45]:
dframe

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [46]:
dframe.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')

In [51]:
dframe = pd.read_excel("Lec_28_test.xlsx", sheet_name="Sheet1")

In [52]:
dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365

In [53]:
import numpy as np
from pandas import DataFrame

In [56]:
dframe1 = DataFrame({"key":["X", "Z", "Y", "Z", "X", "X"],
                   "data_set_1":np.arange(6)})

In [57]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [59]:
dframe2 = DataFrame({"key":["Q","Y","Z"], "data_set_2":[1,2,3]})

In [60]:
dframe2

  key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [61]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [62]:
pd.merge(dframe1,dframe2, on="key")

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [63]:
pd.merge(dframe1, dframe2, on="key", how="left")

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         3.0
2   Y           2         2.0
3   Z           3         3.0
4   X           4         NaN
5   X           5         NaN

In [64]:
pd.merge(dframe1, dframe2, on="key", how="right")

  key  data_set_1  data_set_2
0   Z         1.0           3
1   Z         3.0           3
2   Y         2.0           2
3   Q         NaN           1

In [65]:
pd.merge(dframe1, dframe2, on="key", how="outer")

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         3.0
4   Z         3.0         3.0
5   Y         2.0         2.0
6   Q         NaN         1.0

In [67]:
dframe3 = DataFrame({"key": ["X","X","X","Y","Z","Z"],
                    "data_set_3": range(6)})

In [72]:
dframe4 = DataFrame({"key": ["Y","Y","X","X","Z"],
                    "data_set_4": range(5)})

In [69]:
dframe3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [70]:
dframe4

  key  data_set_3
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

In [73]:
pd.merge(dframe3, dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [75]:
df_right = DataFrame({"key1":["SF","SF","LA","LA"],
                    "key2": ["one", "one", "one", "two"],
                    "left_data":[40,50,60,70]})

In [76]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [77]:
df_right

  key1 key2  left_data
0   SF  one         40
1   SF  one         50
2   LA  one         60
3   LA  two         70

In [78]:
pd.merge(df_left, df_right, on=["key1", "key2"], how="outer")

  key1 key2  left_data_x  left_data_y
0   SF  one         10.0         40.0
1   SF  one         10.0         50.0
2   SF  two         20.0          NaN
3   LA  one         30.0         60.0
4   LA  two          NaN         70.0

In [79]:
pd.merge(df_left,df_right, on = "key1")

  key1 key2_x  left_data_x key2_y  left_data_y
0   SF    one           10    one           40
1   SF    one           10    one           50
2   SF    two           20    one           40
3   SF    two           20    one           50
4   LA    one           30    one           60
5   LA    one           30    two           70

In [80]:
pd.merge(df_left,df_right, on = "key1", suffixes=["_left", "_right"])

  key1 key2_left  left_data_left key2_right  left_data_right
0   SF       one              10        one               40
1   SF       one              10        one               50
2   SF       two              20        one               40
3   SF       two              20        one               50
4   LA       one              30        one               60
5   LA       one              30        two               70

In [81]:
from pandas import DataFrame

In [83]:
dframe1 = DataFrame({"key":["X","Z","Y","Z","X","X"], "data_set_1":np.arange(6)})

In [84]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [85]:
dframe2 = DataFrame({"key":["Q","Y","Z"], "data_set_2":[1,2,3]})

In [86]:
dframe2

  key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [87]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [88]:
pd.merge(dframe1,dframe2, on="key")

  key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [89]:
pd.merge(dframe1,dframe2, on="key", how="left")

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         3.0
2   Y           2         2.0
3   Z           3         3.0
4   X           4         NaN
5   X           5         NaN

In [90]:
pd.merge(dframe1,dframe2, on="key", how="right")

  key  data_set_1  data_set_2
0   Z         1.0           3
1   Z         3.0           3
2   Y         2.0           2
3   Q         NaN           1

In [91]:
pd.merge(dframe1,dframe2, on="key", how="outer")

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         3.0
4   Z         3.0         3.0
5   Y         2.0         2.0
6   Q         NaN         1.0

In [93]:
df_left = DataFrame({"key":["X","Y","Z","X","Y"],
                   "data":range(5)})

In [95]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [98]:
df_right = DataFrame({"group_data":[10,20]},index=["X","Y"])

In [99]:
df_right

   group_data
X          10
Y          20

In [100]:
pd.merge(df_left,df_right, left_on="key", right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [101]:
pd.merge(df_left,df_right, left_on="key", right_index=True,how="outer")

  key  data  group_data
0   X     0        10.0
3   X     3        10.0
1   Y     1        20.0
4   Y     4        20.0
2   Z     2         NaN

In [102]:
df_left_hr = DataFrame({"key1":["SF", "SF", "SF","LA", "LA"],
                       "key2":[10,20,30,20,30],
                       "data_set":np.arange(5)})

In [104]:
df_left_hr

  key1  key2  data_set
0   SF    10         0
1   SF    20         1
2   SF    30         2
3   LA    20         3
4   LA    30         4

In [105]:
df_right_hr = DataFrame(np.arange(10).reshape((5,2)),
                       index=[["LA","LA","SF","SF","SF"],
                             [20,10,10,10,20]],
                       columns=["col_1", "col_2"])

In [106]:
df_right_hr

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [107]:
pd.merge(df_left_hr,df_right_hr, left_on=["key1", "key2"], right_index=True)

  key1  key2  data_set  col_1  col_2
0   SF    10         0      4      5
0   SF    10         0      6      7
1   SF    20         1      8      9
3   LA    20         3      0      1

In [108]:
df_left.join(df_right)

  key  data  group_data
0   X     0         NaN
1   Y     1         NaN
2   Z     2         NaN
3   X     3         NaN
4   Y     4         NaN

In [109]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [110]:
df_right

   group_data
X          10
Y          20

In [111]:
df_right

   group_data
X          10
Y          20

In [112]:
arr1 = np.arange(9).reshape((3,3))

In [113]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [114]:
np.concatenate([arr1,arr1], axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [115]:
np.concatenate([arr1,arr1], axis=0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [118]:
from pandas import Series

In [119]:
ser1 = Series([0,1,2], index=["T","U","V"])
ser2 = Series([3,4], index=["X","Y"])

In [120]:
ser1

T    0
U    1
V    2
dtype: int64

In [121]:
ser2

X    3
Y    4
dtype: int64

In [123]:
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [125]:
pd.concat([ser1,ser2, ser1])

T    0
U    1
V    2
X    3
Y    4
T    0
U    1
V    2
dtype: int64

In [126]:
pd.concat([ser1,ser2], axis=1)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [127]:
pd.concat([ser1,ser2], keys=["cat1", "cat2"])

cat1  T    0
      U    1
      V    2
cat2  X    3
      Y    4
dtype: int64

In [128]:
pd.concat([ser1,ser2], axis=1, keys=["cat1", "cat2"])

   cat1  cat2
T   0.0   NaN
U   1.0   NaN
V   2.0   NaN
X   NaN   3.0
Y   NaN   4.0

In [129]:
dframe1 = DataFrame(np.random.randn(4,3), columns=["X","Y","Z"])

In [130]:
dframe1

          X         Y         Z
0  1.217392  0.824641 -1.605302
1  0.064773 -0.310916 -0.768804
2  0.591252 -0.048786  0.843154
3 -0.118152 -0.352518 -0.400172

In [131]:
dframe2 = DataFrame(np.random.randn(3,3), columns=["Y","Q","X"])

In [132]:
dframe2

          Y         Q         X
0  0.571607  0.248013  1.023834
1  0.436354  0.772791 -0.559126
2 -2.962714  0.004879  0.450418

In [133]:
pd.concat([dframe1,dframe2])

          X         Y         Z         Q
0  1.217392  0.824641 -1.605302       NaN
1  0.064773 -0.310916 -0.768804       NaN
2  0.591252 -0.048786  0.843154       NaN
3 -0.118152 -0.352518 -0.400172       NaN
0  1.023834  0.571607       NaN  0.248013
1 -0.559126  0.436354       NaN  0.772791
2  0.450418 -2.962714       NaN  0.004879

In [134]:
pd.concat([dframe1,dframe2], ignore_index=True)

          X         Y         Z         Q
0  1.217392  0.824641 -1.605302       NaN
1  0.064773 -0.310916 -0.768804       NaN
2  0.591252 -0.048786  0.843154       NaN
3 -0.118152 -0.352518 -0.400172       NaN
4  1.023834  0.571607       NaN  0.248013
5 -0.559126  0.436354       NaN  0.772791
6  0.450418 -2.962714       NaN  0.004879

In [135]:
ser1 = Series([2, np.nan, 4, np.nan, 6, np.nan],
             index=["Q","R","S","T","U","V"])

In [136]:
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [138]:
ser2 = Series(np.arange(len(ser1),dtype=np.float64),
              index=["Q","R","S","T","U","V"])

In [139]:
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [142]:
Series(np.where(pd.isnull(ser1), ser2, ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [143]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [145]:
dframe_odds = DataFrame({"X":[1,np.nan,3,np.nan],
                        "Y":[5,np.nan,7, np.nan],
                        "Z":[9,np.nan,11,np.nan]})

In [146]:
dframe_odds

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [149]:
dframe_evens = DataFrame({"X":[2,4,np.nan,6,8],
                        "Y":[np.nan,10,12,14,16]})

In [151]:
dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [152]:
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   5.0   9.0
1  4.0  10.0   NaN
2  3.0   7.0  11.0
3  6.0  14.0   NaN
4  8.0  16.0   NaN

In [156]:
dframe1 = DataFrame(np.arange(8).reshape((2,4)),
                   index=pd.Index(["LA", "SP"], name="city"),
                   columns=pd.Index(["A","B","C","D"], name="letter"))

In [157]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [158]:
dframe1.stack()

city  letter
LA    A         0
      B         1
      C         2
      D         3
SP    A         4
      B         5
      C         6
      D         7
dtype: int64

In [159]:
dframe_st = dframe1.stack()

In [160]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SP    A         4
      B         5
      C         6
      D         7
dtype: int64

In [161]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [162]:
dframe_st.unstack(0)

city    LA  SP
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [163]:
dframe_st.unstack("city")

city    LA  SP
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [164]:
dframe_st.unstack("letter")

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [165]:
ser1 = Series([0,1,2], index=["Q","X","Y"])
ser2 = Series([4,5,6], index=["X","Y","Z"])

In [169]:
dframe = pd.concat([ser1,ser2], keys=["Alpha", "Beta"])

In [170]:
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [171]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [172]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [173]:
dframe.unstack().stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [176]:
import pandas.util.testing as tm

In [180]:
tm.N = 3

def unpivot(frame):
    N,K = frame.shape
    data = {"value":frame.values.ravel("F"),
           "variable":np.asarray(frame.columns).repeat(N),
           "date":np.tile(np.asarray(frame.index),K)}
    return DataFrame(data, columns=["date","variable","value"])

dframe = unpivot(tm.makeTimeDataFrame())

In [181]:
dframe

          date variable     value
0   2000-01-03        A  1.920643
1   2000-01-04        A -0.063819
2   2000-01-05        A -0.878988
3   2000-01-06        A -1.409201
4   2000-01-07        A -1.705711
..         ...      ...       ...
115 2000-02-07        D -0.856089
116 2000-02-08        D -0.829103
117 2000-02-09        D  0.687129
118 2000-02-10        D  0.685653
119 2000-02-11        D  1.491017

[120 rows x 3 columns]

In [182]:
dframe_piv = dframe.pivot("date", "variable", "value")

In [183]:
dframe_piv

variable           A         B         C         D
date
2000-01-03  1.920643 -1.893278  0.721617  0.416897
2000-01-04 -0.063819  0.274810 -0.177680 -1.257656
2000-01-05 -0.878988  0.087435  0.861714 -0.744439
2000-01-06 -1.409201  0.823653 -0.777549  1.076882
2000-01-07 -1.705711  0.896780  0.588807  0.032395
2000-01-10  0.569760 -0.410982 -1.345104  2.099491
2000-01-11  0.183669  1.526715 -0.800733 -0.710547
2000-01-12 -0.521261  1.502339 -0.308922 -0.519043
2000-01-13  1.178540  1.997751 -0.176830  0.058228
2000-01-14  1.344628  1.361614 -0.002297 -0.014683
2000-01-17 -0.715367  0.141424 -0.494654  0.197124
2000-01-18 -0.074675  0.326872  0.474965  0.085945
2000-01-19  0.035236  1.628916  0.853183 -0.633960
2000-01-20 -1.106553  1.411504 -0.589589 -0.940106
2000-01-21 -0.425897  1.300579 -0.057828  0.288043
2000-01-24 -0.574946  0.119250  0.141604  0.246443
2000-01-25 -0.160435  0.054267 -1.038852 -1.618007
2000-01-26 -0.492293 -1.967277  0.621199 -0.577635
2000-01-27  1.189006  1.678201  0.227395  0.009933
2000-01-28  0.909642  0.217299  0.559975  0.880504
2000-01-31  1.389834  0.052047 -0.308428  0.424278
2000-02-01  1.464731  1.018965 -0.509164  1.337406
2000-02-02 -1.121041  0.497321 -0.400062 -0.187121
2000-02-03 -0.434933  0.133015  0.493782 -0.075851
2000-02-04  1.260249 -0.011431  1.355898  0.354582
2000-02-07  1.101221 -0.208336  0.280360 -0.856089
2000-02-08 -0.599498 -0.391597 -0.563565 -0.829103
2000-02-09  1.363740 -0.661952  1.170685  0.687129
2000-02-10 -0.596943 -0.312399  0.211365  0.685653
2000-02-11  0.061527 -1.114125 -0.598393  1.491017

In [184]:
dframe = DataFrame({"key1":["A"]*2 + ["B"]*3,
                   "key2":[2,2,2,3,3]})

In [185]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [186]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [187]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [188]:
dframe.drop_duplicates("key1")

  key1  key2
0    A     2
2    B     2

In [189]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [192]:
dframe.drop_duplicates(["key1"], keep="last")

  key1  key2
1    A     2
4    B     3

In [193]:
dframe = DataFrame({"city":["Alma", "Brian Head", "Fox Park"],
                   "altitude":[3158,3000,2752]})

In [194]:
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2752

In [195]:
state_map={"Alma":"Colorado", "Brian Head":"Utah", "Fox Park":"Wyoming"}

In [196]:
#mapメソッドにより、定義した辞書を追加できる。
dframe["state"] = dframe["city"].map(state_map)

In [197]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2752   Wyoming

In [198]:
#これでもいけるが、mapメソッドを使うことにより、関連性が高いものを追加しやすい。
dframe["key1"] = [0,1,2]

In [199]:
dframe

         city  altitude     state  key1
0        Alma      3158  Colorado     0
1  Brian Head      3000      Utah     1
2    Fox Park      2752   Wyoming     2

In [200]:
ser1 = Series([1,2,3,4,1,2,3,4])

In [201]:
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [202]:
ser1.replace(1, np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [203]:
ser1.replace([1,4], [100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [204]:
ser1.replace({4:np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

In [213]:
dframe = DataFrame(np.arange(12).reshape((3,4)),
                  index = ["NY","LA","SF"],
                  columns= ["A","B","C","D"])

In [208]:
dframe

         city  altitude     state  key1
0        Alma      3158  Colorado     0
1  Brian Head      3000      Utah     1
2    Fox Park      2752   Wyoming     2

In [209]:
str.lower("A")

'a'

In [214]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [215]:
dframe.index = dframe.index.map(str.lower)

In [216]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [217]:
str.title("udemy is good")

'Udemy Is Good'

In [218]:
dframe.rename(index=str.title,columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [219]:
dframe.rename(index={"ny":"NEW YORK"},
             columns={"A":"ALPHA"})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [220]:
dframe.rename(index={"ny":"NEW YORK"},
             columns={"A":"ALPHA"}, inplace=True)

In [221]:
dframe

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [222]:
years = [1990,1991,1992,2008,2012,2015,1987,1969, 2013, 2008, 1999]

In [223]:
len(years)

11

In [224]:
decade_bins=[1960,1970,1980,1990,2000,2010,2020]

In [226]:
decade_cut = pd.cut(years, decade_bins)

In [227]:
decade_cut

[(1980, 1990], (1990, 2000], (1990, 2000], (2000, 2010], (2010, 2020], ..., (1980, 1990], (1960, 1970], (2010, 2020], (2000, 2010], (1990, 2000]]
Length: 11
Categories (6, interval[int64]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [228]:
decade_cut.categories

IntervalIndex([(1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]],
              closed='right',
              dtype='interval[int64]')

In [229]:
pd.value_counts(decade_cut)

(2010, 2020]    3
(1990, 2000]    3
(2000, 2010]    2
(1980, 1990]    2
(1960, 1970]    1
(1970, 1980]    0
dtype: int64

In [230]:
pd.cut(years, 2)

[(1968.954, 1992.0], (1968.954, 1992.0], (1968.954, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], ..., (1968.954, 1992.0], (1968.954, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], (1992.0, 2015.0]]
Length: 11
Categories (2, interval[float64]): [(1968.954, 1992.0] < (1992.0, 2015.0]]

In [231]:
np.random.seed(12345)

In [232]:
dframe = DataFrame(np.random.randn(1000,4))

In [233]:
dframe.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [236]:
dframe.tail()

            0         1         2         3
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

In [237]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [239]:
col = dframe[0]

In [240]:
 col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

In [241]:
col[np.abs(cal)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

In [242]:
np.abs(dframe)> 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [245]:
dframe[(np.abs(dframe)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [247]:
np.sign(dframe)

       0    1    2    3
0   -1.0  1.0 -1.0 -1.0
1    1.0  1.0  1.0  1.0
2    1.0  1.0  1.0 -1.0
3    1.0  1.0  1.0  1.0
4   -1.0 -1.0  1.0 -1.0
..   ...  ...  ...  ...
995  1.0  1.0 -1.0  1.0
996 -1.0 -1.0 -1.0 -1.0
997 -1.0  1.0  1.0  1.0
998 -1.0 -1.0 -1.0 -1.0
999  1.0  1.0  1.0  1.0

[1000 rows x 4 columns]

In [248]:
dframe[np.abs(dframe)>3] = np.sign(dframe)*3

In [250]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [251]:
dframe = DataFrame(np.arange(4*4).reshape((4,4)))

In [252]:
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [253]:
blender = np.array([0,3,2,1])

In [255]:
dframe.take(blender)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [256]:
blender = np.random.permutation(4)

In [257]:
blender

array([1, 3, 2, 0])

In [258]:
dframe.take(blender)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [259]:
box = np.array(["A", "B", "C"])

In [260]:
box

array(['A', 'B', 'C'], dtype='<U1')

In [263]:
shaker = np.random.randint(0,len(box), size=10)

In [264]:
shaker

array([2, 0, 2, 0, 0, 2, 1, 1, 2, 1])

In [265]:
hand_grabs = box.take(shaker)

In [266]:
hand_grabs

array(['C', 'A', 'C', 'A', 'A', 'C', 'B', 'B', 'C', 'B'], dtype='<U1')

In [271]:
dframe = DataFrame({"k1":["X","X","Y","Y","Z"],
                   "k2":["alpha","beta","alpha","beta","alpha"],
                   "dataset1":np.random.randn(5),
                   "dataset2":np.random.randn(5)})

In [273]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
1  X   beta -0.087746 -1.122283
2  Y  alpha -0.658604  0.282891
3  Y   beta  0.497419 -1.695303
4  Z  alpha  0.566194  1.401972

In [275]:
group1 = dframe["dataset1"].groupby(dframe["k1"])

In [276]:
group1

In [277]:
group1.mean()

k1
X    0.006678
Y   -0.080593
Z    0.566194
Name: dataset1, dtype: float64

In [279]:
cities = np.array(["NY","LA","LA","NY","NY"])
manth = np.array(["JAN","FEB","JAN","FEB","JAN"])

In [280]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
1  X   beta -0.087746 -1.122283
2  Y  alpha -0.658604  0.282891
3  Y   beta  0.497419 -1.695303
4  Z  alpha  0.566194  1.401972

In [282]:
dframe["dataset1"].groupby([cities,manth]).mean()

LA  FEB   -0.087746
    JAN   -0.658604
NY  FEB    0.497419
    JAN    0.333649
Name: dataset1, dtype: float64

In [285]:
dframe.groupby("k1").mean()

    dataset1  dataset2
k1
X   0.006678 -0.769824
Y  -0.080593 -0.706206
Z   0.566194  1.401972

In [286]:
dframe.groupby(["k1","k2"]).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.101103 -0.417365
   beta  -0.087746 -1.122283
Y  alpha -0.658604  0.282891
   beta   0.497419 -1.695303
Z  alpha  0.566194  1.401972

In [289]:
detaset2_group = dframe.groupby(["k1","k2"])[["dataset2"]]

In [290]:
detaset2_group.mean()

          dataset2
k1 k2
X  alpha -0.417365
   beta  -1.122283
Y  alpha  0.282891
   beta  -1.695303
Z  alpha  1.401972

In [291]:
dframe.groupby(["k1"]).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [292]:
for name, group in dframe.groupby("k1"):
    print("This is the {} group".format(name))
    print(group)
    print("¥n")

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
1  X   beta -0.087746 -1.122283
¥n
This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.658604  0.282891
3  Y   beta  0.497419 -1.695303
¥n
This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.566194  1.401972
¥n

In [294]:
for (k1,k2), group in dframe.groupby(["k1","k2"]):
    print("Key1={} Key2={}".format(k1,k2))
    print(group)
    print("¥n")

Key1=X Key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
¥n
Key1=X Key2=beta
  k1    k2  dataset1  dataset2
1  X  beta -0.087746 -1.122283
¥n
Key1=Y Key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.658604  0.282891
¥n
Key1=Y Key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.497419 -1.695303
¥n
Key1=Z Key2=alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.566194  1.401972
¥n

In [295]:
gr = dframe.groupby("k1")

In [296]:
gr.get_group("X")

  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
1  X   beta -0.087746 -1.122283

In [297]:
group_dict = dict(list(dframe.groupby("k1")))

In [299]:
group_dict["X"]

  k1     k2  dataset1  dataset2
0  X  alpha  0.101103 -0.417365
1  X   beta -0.087746 -1.122283

In [302]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [303]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.101103 -0.417365
 1 -0.087746 -1.122283
 2 -0.658604  0.282891
 3  0.497419 -1.695303
 4  0.566194  1.401972,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}